Revit 2024 API
BuiltInFailures.DisplacementElementFailures Class
 Error messages related to the DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DisplacementElementFailures
Visual Basic
Public NotInheritable Class DisplacementElementFailures
Visual C++
public ref class DisplacementElementFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures
See Also
BuiltInFailures.DisplacementElementFailures Members
Autodesk.Revit.DB Namespace